<?php
define('NAME_REGEX', "/^[A-Za-zÀÁÂÃÄÅàáâãäåÒÓÔÕÖØòóôõöøÈÉÊËèéêëÇçÌÍÎÏìíîïÙÚÛÜùúûüÿÑñ'. -]{2,50}$/");
define('MAIL_REGEX', "/^[a-z0-9._%+-]+@[a-z0-9.-]+\.[a-z]{2,}$/");
define('SIREN_REGEX', "/^\d{9}$/");
define('NIC_CODE_POST_REGEX', "/^\d{5}$/");
define('PHONE_FR_REGEX', "/^(0|\+33)[1-9]([-. ]?[0-9]{2}){4}$/");
define('ADDRESS_REGEX', "/^[A-Za-z0-9ÀÁÂÃÄÅàáâãäåÒÓÔÕÖØòóôõöøÈÉÊËèéêëÇçÌÍÎÏìíîïÙÚÛÜùúûüÿÑñ',. -]{1,150}$/");
define('PWD_REGEX', "/^(?=.*[A-Za-z])(?=.*\d)(?=.*[@$!%*#?&])[A-Za-z\d@$!%*#?&]{8,50}$/");

